---
type: Tile
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 29
tags: [revit-api, class]
---

# Tile

`Autodesk.Revit.DB.Visual.Tile` · Revit 2024 · 29 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | TextureLinkTextureTransforms | 2018.1 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureOffsetLock | 2018.1 | `public static string TextureOffsetLock { get ; }` |
| Property | TextureRealWorldOffsetX | 2018.1 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018.1 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldScaleX | 2018.1 | `public static string TextureRealWorldScaleX { get ; }` |
| Property | TextureRealWorldScaleY | 2018.1 | `public static string TextureRealWorldScaleY { get ; }` |
| Property | TextureScaleLock | 2018.1 | `public static string TextureScaleLock { get ; }` |
| Property | TextureURepeat | 2018.1 | `public static string TextureURepeat { get ; }` |
| Property | TextureVRepeat | 2018.1 | `public static string TextureVRepeat { get ; }` |
| Property | TextureWAngle | 2018.1 | `public static string TextureWAngle { get ; }` |
| Property | TileBrickColor | 2018.1 | `public static string TileBrickColor { get ; }` |
| Property | TileBrickType | 2018.1 | `public static string TileBrickType { get ; }` |
| Property | TileChangeColumn | 2018.1 | `public static string TileChangeColumn { get ; }` |
| Property | TileChangeRow | 2018.1 | `public static string TileChangeRow { get ; }` |
| Property | TileColorVariance | 2018.1 | `public static string TileColorVariance { get ; }` |
| Property | TileEdgeRoughness | 2018.1 | `public static string TileEdgeRoughness { get ; }` |
| Property | TileFadeVariance | 2018.1 | `public static string TileFadeVariance { get ; }` |
| Property | TileHorizontalCount | 2018.1 | `public static string TileHorizontalCount { get ; }` |
| Property | TileHorizontalGap | 2018.1 | `public static string TileHorizontalGap { get ; }` |
| Property | TileLineShift | 2018.1 | `public static string TileLineShift { get ; }` |
| Property | TileMortarColor | 2018.1 | `public static string TileMortarColor { get ; }` |
| Property | TilePerColumn | 2018.1 | `public static string TilePerColumn { get ; }` |
| Property | TilePerRow | 2018.1 | `public static string TilePerRow { get ; }` |
| Property | TileRandomSeed | 2018.1 | `public static string TileRandomSeed { get ; }` |
| Property | TileRandomShift | 2018.1 | `public static string TileRandomShift { get ; }` |
| Property | TileUseColumnEdit | 2018.1 | `public static string TileUseColumnEdit { get ; }` |
| Property | TileUseRowEdit | 2018.1 | `public static string TileUseRowEdit { get ; }` |
| Property | TileVerticalCount | 2018.1 | `public static string TileVerticalCount { get ; }` |
| Property | TileVerticalGap | 2018.1 | `public static string TileVerticalGap { get ; }` |